## Q1. List any five functions of the pandas library with execution.

## Ans:- 1:-set_index:- by setindex we can set any column of the dataset as index.

In [1]:
import pandas as pd
data={'a':[1,2,3,4,5],
      'b':[6,7,8,9,20],
      'c':['sudh','dikshant','rohit','raman','popi']
     }
df=pd.DataFrame(data)

In [2]:
df

   a   b         c
0  1   6      sudh
1  2   7  dikshant
2  3   8     rohit
3  4   9     raman
4  5  20      popi

In [3]:
df.set_index('a',inplace=True)

In [4]:
df

    b         c
a
1   6      sudh
2   7  dikshant
3   8     rohit
4   9     raman
5  20      popi

## 2:-reset_index:- by reset_index we can perform a reset index of the dataset as before.

In [5]:
df.reset_index()

   a   b         c
0  1   6      sudh
1  2   7  dikshant
2  3   8     rohit
3  4   9     raman
4  5  20      popi

## 3:- reindex:- by reindex we can change the row index and the column labels.
## note:- the values are set to NaN if the new index is not the same as the old.

In [6]:
data={'a':[1,2,3,4,5],
      'b':[6,7,8,9,20],
      'c':['sudh','dikshant','rohit','raman','popi']
     }
df=pd.DataFrame(data,index=['a','b','c','d','e'])

In [7]:
df

   a   b         c
a  1   6      sudh
b  2   7  dikshant
c  3   8     rohit
d  4   9     raman
e  5  20      popi

In [8]:
df.reindex(['b','a','d','f'])

     a    b         c
b  2.0  7.0  dikshant
a  1.0  6.0      sudh
d  4.0  9.0     raman
f  NaN  NaN       NaN

## 4:- rolling window:-dataframe.rolling(window=n).any operation function provides the feature of rolling window calculations. the concept of rolling window calculation is most primarily used in signal processing and time-series data.
## we take a window size n at a time and perform some desired operation on it. a window of size n means n consecutive values at a time. 
## all the n values are equally weighted.

In [9]:
df1=pd.DataFrame({'a':[1,2,3,4,5,67]})

In [10]:
df1

    a
0   1
1   2
2   3
3   4
4   5
5  67

df1.rolling(window=2).mean()

In [11]:
df1.rolling(window=2).sum()

      a
0   NaN
1   3.0
2   5.0
3   7.0
4   9.0
5  72.0

## 5:-date function:-  by date function we can get all the date between two dates.

In [12]:
data=pd.date_range(start='2022-05-12' ,end='2022-06-12')

In [13]:
data

DatetimeIndex(['2022-05-12', '2022-05-13', '2022-05-14', '2022-05-15',
               '2022-05-16', '2022-05-17', '2022-05-18', '2022-05-19',
               '2022-05-20', '2022-05-21', '2022-05-22', '2022-05-23',
               '2022-05-24', '2022-05-25', '2022-05-26', '2022-05-27',
               '2022-05-28', '2022-05-29', '2022-05-30', '2022-05-31',
               '2022-06-01', '2022-06-02', '2022-06-03', '2022-06-04',
               '2022-06-05', '2022-06-06', '2022-06-07', '2022-06-08',
               '2022-06-09', '2022-06-10', '2022-06-11', '2022-06-12'],
              dtype='datetime64[ns]', freq='D')

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

## :-Ans:-

In [14]:
import pandas as pd
df2=pd.DataFrame({'A':[1,2,3],
                 'B':[6,7,8],
                 'C':[11,12,13]})

In [15]:
df2

   A  B   C
0  1  6  11
1  2  7  12
2  3  8  13

In [16]:
df2.reindex([1,2])

   A  B   C
1  2  7  12
2  3  8  13

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [17]:
df3=pd.DataFrame({'values':[10,20,30,40,50]})
df3

   values
0      10
1      20
2      30
3      40
4      50

In [18]:
for i in df3.iteritems():
    print(i)
df4=df3.iloc[0:3]
sum_threevalues=df4['values'].sum()
print("the sum of three values is : ",sum_threevalues)

('values', 0    10
1    20
2    30
3    40
4    50
Name: values, dtype: int64)
the sum of three values is :  60

/tmp/ipykernel_95/2966099733.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df3.iteritems():

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [19]:
df5=pd.DataFrame({'Text':['rahul is a good boy','subham is a good boy and he is working in the field of data science','it is raining today from morning']})

In [20]:
df5

                                                Text
0                                rahul is a good boy
1  subham is a good boy and he is working in the ...
2                   it is raining today from morning

In [21]:
df5['words_count']=df5['Text'].apply(lambda a: len(a.split()))

In [22]:
df5

                                                Text  words_count
0                                rahul is a good boy            5
1  subham is a good boy and he is working in the ...           15
2                   it is raining today from morning            6

## Q5. How are DataFrame.size() and DataFrame.shape() different?

## Ans:- dataframe.shape():-dataframe.shape return a tuple of the dimension of the dataframe.
## it tells us about row and column. how many rows and column have dataframe.

In [23]:
import pandas as pd
df6=pd.DataFrame({'values':[10,20,30,40,50],'name':['dikshant','kumar','rajput','shivam','sonu']})
df6

   values      name
0      10  dikshant
1      20     kumar
2      30    rajput
3      40    shivam
4      50      sonu

In [24]:
df6.shape ## it have 5 row and 2 columns

(5, 2)

In [25]:
df6.ndim

2

## dataframe.size():-Returns size of dataframe/series which is equivalent to total number of elements.

In [26]:
df6.size# it have 10 elements.

10

## Q6. Which function of pandas do we use to read an excel file?

## Ans:- pd.read_excel("file_name")

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains emaila ddresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
## The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username'column.

## Ans:-

In [27]:
df7=pd.DataFrame({'email_address':["dikshant@gmail.com","rahul@gmail.com","shivam@gmail.com"]})

In [28]:
df7

        email_address
0  dikshant@gmail.com
1     rahul@gmail.com
2    shivam@gmail.com

In [29]:
df7["username"]=df7["email_address"].str.split('@').str[0]

In [30]:
df7

        email_address  username
0  dikshant@gmail.com  dikshant
1     rahul@gmail.com     rahul
2    shivam@gmail.com    shivam

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.For example, if df contains the following values:
##    A B C
## 0  3 5 1
## 1  8 2 7
## 2  6 9 4
## 3  2 3 5
## 4  9 1 2

## Your function should select the following rows: A B C
## 1 8 2 7
## 4 9 1 2
## The function should return a new DataFrame that contains only the selected rows.

## Ans:-

In [31]:
import pandas as pd
df8=pd.DataFrame({"A":[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [32]:
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [33]:
df8[(df8['B']<10) & (df8['A']>5)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

## Ans:-

In [34]:
df9=pd.DataFrame({'values':[10,20,30,40,50]})
df9

   values
0      10
1      20
2      30
3      40
4      50

In [35]:
print(df9['values'].mean())
print(df9['values'].median())
print(df9['values'].std())

30.0
30.0
15.811388300841896

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

## Ans:-

In [36]:
import pandas as pd
df10=pd.DataFrame({'sales':[12,45,78,12,89,34,23,67,89,23,45,67,22,5,12,69,13,42,78,12,34,56,12,91,80,87,89,90,32,75],'data':pd.date_range(start='2023-03-01',end='2023-03-30')})

In [37]:
df10

    sales       data
0      12 2023-03-01
1      45 2023-03-02
2      78 2023-03-03
3      12 2023-03-04
4      89 2023-03-05
5      34 2023-03-06
6      23 2023-03-07
7      67 2023-03-08
8      89 2023-03-09
9      23 2023-03-10
10     45 2023-03-11
11     67 2023-03-12
12     22 2023-03-13
13      5 2023-03-14
14     12 2023-03-15
15     69 2023-03-16
16     13 2023-03-17
17     42 2023-03-18
18     78 2023-03-19
19     12 2023-03-20
20     34 2023-03-21
21     56 2023-03-22
22     12 2023-03-23
23     91 2023-03-24
24     80 2023-03-25
25     87 2023-03-26
26     89 2023-03-27
27     90 2023-03-28
28     32 2023-03-29
29     75 2023-03-30

In [38]:
df10['moving_average']=df10.rolling(window=7).mean()

/tmp/ipykernel_95/1357946603.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['data'], dtype='object')
  df10['moving_average']=df10.rolling(window=7).mean()

In [39]:
df10

    sales       data  moving_average
0      12 2023-03-01             NaN
1      45 2023-03-02             NaN
2      78 2023-03-03             NaN
3      12 2023-03-04             NaN
4      89 2023-03-05             NaN
5      34 2023-03-06             NaN
6      23 2023-03-07       41.857143
7      67 2023-03-08       49.714286
8      89 2023-03-09       56.000000
9      23 2023-03-10       48.142857
10     45 2023-03-11       52.857143
11     67 2023-03-12       49.714286
12     22 2023-03-13       48.000000
13      5 2023-03-14       45.428571
14     12 2023-03-15       37.571429
15     69 2023-03-16       34.714286
16     13 2023-03-17       33.285714
17     42 2023-03-18       32.857143
18     78 2023-03-19       34.428571
19     12 2023-03-20       33.000000
20     34 2023-03-21       37.142857
21     56 2023-03-22       43.428571
22     12 2023-03-23       35.285714
23     91 2023-03-24       46.428571
24     80 2023-03-25       51.857143
25     87 2023-03-26       53.142857
26     89 2023-03-27       64.142857
27     90 2023-03-28       72.142857
28     32 2023-03-29       68.714286
29     75 2023-03-30       77.714286

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

# Ans:-

In [40]:
import pandas as pd 
df11=pd.DataFrame({'date':pd.date_range(start='2023-01-01',end='2023-01-05')})

In [41]:
df11

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [42]:
df11.dtypes

date    datetime64[ns]
dtype: object

In [62]:
df11['weekday']=df11['date'].dt.strftime("%A") #%A = is a directives that return full name of the day.

In [63]:
df11

        date    weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [77]:
import pandas as pd 
df12=pd.DataFrame({'date':pd.date_range(start='2023-01-01',end='2023-01-31')})

In [79]:
df12.dtypes

date    datetime64[ns]
dtype: object

In [83]:
df12['timestamps']=pd.Timedelta(hours=5,minutes=55)

In [84]:
df12

         date      timestamps
0  2023-01-01 0 days 05:55:00
1  2023-01-02 0 days 05:55:00
2  2023-01-03 0 days 05:55:00
3  2023-01-04 0 days 05:55:00
4  2023-01-05 0 days 05:55:00
5  2023-01-06 0 days 05:55:00
6  2023-01-07 0 days 05:55:00
7  2023-01-08 0 days 05:55:00
8  2023-01-09 0 days 05:55:00
9  2023-01-10 0 days 05:55:00
10 2023-01-11 0 days 05:55:00
11 2023-01-12 0 days 05:55:00
12 2023-01-13 0 days 05:55:00
13 2023-01-14 0 days 05:55:00
14 2023-01-15 0 days 05:55:00
15 2023-01-16 0 days 05:55:00
16 2023-01-17 0 days 05:55:00
17 2023-01-18 0 days 05:55:00
18 2023-01-19 0 days 05:55:00
19 2023-01-20 0 days 05:55:00
20 2023-01-21 0 days 05:55:00
21 2023-01-22 0 days 05:55:00
22 2023-01-23 0 days 05:55:00
23 2023-01-24 0 days 05:55:00
24 2023-01-25 0 days 05:55:00
25 2023-01-26 0 days 05:55:00
26 2023-01-27 0 days 05:55:00
27 2023-01-28 0 days 05:55:00
28 2023-01-29 0 days 05:55:00
29 2023-01-30 0 days 05:55:00
30 2023-01-31 0 days 05:55:00

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

## Ansto use basic function of pandas we needs to imoprt pandas.